rails_shows_api/app/controllers/gigs_controller.rb

SELECT "gigs".* FROM "gigs"
---
    def index
        @gigs = Gig.all

SELECT  "gigs".* FROM "gigs" WHERE "gigs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def show
        @gig = Gig.find(params[:id])

INSERT INTO "gigs" ("name", "date", "location", "genre", "event_info", "tickets_url", "image_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
    def create
        @gig = Gig.new(gig_params)

        if @gig.save

SELECT  "gigs".* FROM "gigs" WHERE "gigs"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "gigs" SET "name" = $1, "date" = $2, "borough" = $3, "updated_at" = $4 WHERE "gigs"."id" = $5  [["name", "Shenae"], ["date", "03/29/2019"], ["borough", ""], ["updated_at", "2019-06-06 23:24:00.099051"], ["id", 1]]
---
      def update
        @gig = Gig.find(params[:id])
        if @gig.update(gig_params)

SELECT  "gigs".* FROM "gigs" WHERE "gigs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "gigs" WHERE "gigs"."id" = $1  [["id", 2]]
---
    def destroy
        @gig = Gig.find(params[:id])
       if @gig.destroy